# 강의를 듣고 스스로 구혀할 수 있으려면?
- 단순 듣기, 단순 따라쓰기 => 머리에 남는 게 없음
- 어렵게 공부해야 함
    - 요약하기, 나만의 말로 바꿔서 글 쓰기, 남한테 설명하기, 그림으로 도식화하기
    - 시간이 오래 들지만, 단기에서 장기 기억으로 변환됨
- 가장 쉬운 방법은 블로그 쓰기임
    - 복붙은 도움이 되지 않고, 직접 요약하고 이해하는 과정이 중요함
    - 다음에 스스로 구현할 때 내가 기록한 글만을 보고 구현할 수 있게끔 정리해야지하는 목표를 가지자

# 파레토의 법칙
- 개발분야는 외울 게 많아서 다 외워서 하려고 하면 공부에 끝이 없다.
- 중요한, 자주 사용하는 20%만 알아도 80%는 그 때 그 때 찾아서 할 수 있다.
- 20%만 공부하고 실전에서 해보는 게 실력이 더 빨리 늘 수 있음

# First word 법칙
- 처음 공부하면 이해 안 되는 용어가 많음
- 어떤 의미인지 기록으로 남겨서 정리하면 훨씬 이해가 빨라짐
- 딱딱하게 정의를 정리하는 것보다 내가 이해할 수 있는 직관적인 의미를 정리하자

# 주석 공부법
- 이해가 안 되는데, 손으로만 코드를 쓰고 있는 경우가 많음
- 코드 한 줄마다 어떤 의미인지 주석을 달아보자
- 강의에서 직접 한 줄씩 의미를 설명해주진 않으므로, 스스로 검색하면서 저 코드의 역할은 뭔지 저 코드는 왜 썼는지 분석해야 함
